// //Оператори розгалуження
// //if, if...else, else...if


// //if

// //if(умова){
// // код,який буде виконаний у разі якщо умова = true}


// const balance = prompt("Введіть свій баланс");
// const purchase = prompt("Введіть ціну своєї покупки");
// // console.log(purchase >= balance); //якщо true, код іде далі
// // if (purchase <= balance) {
// //     console.log(purchase <= balance); //якщо true, код іде далі
// //     console.log("У вас достатньо грошей для здійснення покупки");
// // }




// //if..else

// // if (умова) {
//     //якщо умова виконалася
// // } else {
//     //якщо умова не виконалася
// // }


// // if (purchase <= balance) {
// //     alert("У вас достатньо грошей для здійснення покупки");
// // } else {
// //     alert("Вибачте, у вас недостатньо грошей для здійснення покупки");
// // }

// purchase <= balance
//   ? alert("У вас достатньо грошей для здійснення покупки")
//   : alert("Вибачте, у вас недостатньо грошей для здійснення покупки");



// //else..if

// // if (умова1) {
// //     код,який буде виконаний,якщо значення умови 1 = true
// // } else if (умова2) {
// //     код який буде виконаний,якщо значення умови2 = true
// // }else if (умова3) {
// //     код який буде виконаний,якщо значення умови3 = true
// // }else if (умова4) {
// //     код який буде виконаний,якщо значення умови4 = true
// // }else if (умова5) {
// //     код який буде виконаний,якщо значення умови5 = true
// // } else {
// //     код який буде виконаний, якщо всі попередні умови = false
// // }


// let totalSpent = 500;//баланс клієнта
// let payment = prompt("Введіть суму покупки:");//вартість товару
// let discount = 0;//знижка

// if (totalSpent >= 100 && totalSpent < 1000) {
//     discount = 0.02;
//     alert("Ви наш бронзовий партнер, ваша знижка 2%");
// } else if (totalSpent >= 1000 && totalSpent < 3000) {
//     discount = 0.05;
//     alert("Ви наш серебрений партнер, ваша знижка 5%");
// } else if (totalSpent >= 3000 && totalSpent < 10000) {
//     discount = 0.08;
//     alert("Ви наш золотий! Ви отримуєте 8% знижки");
// } else if (totalSpent >= 10000) {
//     discount = 0.1;
//     alert("Ви наш бріліантовий! Отримуєте 10% знижки");
// } else {
//     alert("Працюйте краще і отримаєте більше! На сьогодні знижок немає..");
// }
// // payment = payment - payment * discount;
// payment -= payment * discount;
// alert(`Оформлено замовлення на ${payment} із знижкою - ${discount * 100}%`);



//Тернарний оператор
// умова ? значення якщо умова = true: значення якщо умова = false

