//Цикли

//While (цикл з передумовою)-  цикл,який виконується поки істинна деяка умова, вказана перед його початком

//Інструкція while створює цикл,який виконує блок, коду,поки умова перевірки оцінюється як true


// while (умова) {
//     тіло циклу - код/інструкція для виконання
// }


let i = 1;
let and = 10;

while (i <= and) {
    console.log(i);
    i = i + 1; // i = 1+1  лічильник
}

console.log("Виконуємо задачу після цикла WHILE!!!");

let min = 10;
let max = 100;

while (min <= max) {
    if (min % 5 === 0) {
        console.log(min);
    }
    min = min + 1;
}