//БІБЛІОТЕКА LODASH - сторонній код який можна
//  підкл. до свого проекта і
//  виконати якусь функц.
//можна підкл через CDN


// CDN - геогр. розроділ.
// мережева інфраструктура, що забезепеч.
// швидку доставку контенту користувачам
// і веб-сервірів


//THROTTLE - забезпеч. контроль
// на к-стю разів, які функц. може бути
// викликана протягом проміжку часу
// (сповільнює опрацювання)


//DEBOUNCE - гарантує, що функц.
//  не буде вклакана знову, поки не пройде
// певна к-сть часу без її виклику

//режими дебоунсе
//trailing edge(в кінці)
//leading edge(на початку)

